---
kind: method
id: M:Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.GetPlane
source: html/4f917f3d-8ee3-c5c8-82e0-ab181769e62c.htm
---
# Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.GetPlane Method

Gets the plane representing the normal and origin of the surface containg the base profile curve loop of the roof or floor slab.

## Syntax (C#)
```csharp
public Plane GetPlane()
```

## Returns
The plane.